#+BEGIN_COMMENT
.. title: Binary Search
.. slug: binary-search
.. date: 2018-07-04 17:28:44 UTC-07:00
.. tags: algorithms problems divideandconquer
.. category: divideandconquer
.. link: 
.. description: Implementing a Binary Search
.. type: text
#+END_COMMENT

** Testing

#+BEGIN_SRC python :session binary :results output
q = 9
K = [1, 3, 7, 8, 9, 12, 15]
expected = 4
actual = binary_search(K, q, True)
expect(actual).to(equal(expected))
#+END_SRC

#+RESULTS:
: In loop 1 - 0:6
: In loop 2 - 4:6
: In loop 3 - 4:4

Looking at the output you can see that after finding that the middle element didn't match /q/ it searched the upper half of the list (by raising the Minimum Index to 4) and then found /q/ at the point where the Minimum and Maximum Index were equal.

We can compare this to the linear search.

#+BEGIN_SRC python :session binary :results output
actual = linear_search(K, q)
expect(actual).to(equal(expected))
#+END_SRC

#+RESULTS:
: Loop 1
: Loop 2
: Loop 3
: Loop 4
: Loop 5

It works but it takes a little longer. You can see the theoretical (Big-O) runtimes are different as well.

#+BEGIN_SRC python :session binary :results output
print("O(n): {}".format(len(K)))
print("O(log n): {:.2f}".format(log(len(K), 2)))
#+END_SRC

#+RESULTS:
: O(n): 7
: O(log n): 2.81

* Testing

#+BEGIN_SRC python :session binary :results output
for example, case in TEST_CASES.items():
    print(example)
    expected = case[TestKeys.expected]
    actual = multiple_search(case[TestKeys.source],
                             case[TestKeys.search_terms])
    expect(actual).to(equal(expected))
#+END_SRC

#+RESULTS:
: one
: two

